### Feature Engineering 

A partir de los csv´s ya procesados, vamos a preparar el conjunto de datos que utilizaremos para realizar las consultas en la API.

In [1]:
import pandas as pd
import tools 
import pyarrow as pa 
import pyarrow.parquet as pq 
import warnings 
warnings.filterwarnings("ignore") 

df_user_reviews = pd.read_csv("user_reviews_cleaned.csv", encoding="utf-8")
df_users_items = pd.read_csv("users_items_cleaned.csv", encoding="utf-8")
df_steam_games = pd.read_csv("steam_games_cleaned.csv", encoding="utf-8")

### Análisis de sentimientos

Uno de los requerimientos dentro de este proyecto es que reemplacemos la columna "reviews_review" con una llamada "sentiment_analysis". Esta última realizara un analisis de los comentarios teniendo los siguientes parámetros:

* 0 si es malo,
* 1 si es neutral o no contiene un review
* 2 si es positivo.


Realizaremos un análisis de sentimiento básico utilizando TextBlob que es una biblioteca de procesamiento de lenguaje natural (NLP) en Python, ya que el objetivo de este proyecto es realizar una prueba de concepto para conseguir el producto mínimo viable. Con TextBlob, podremos asignarle un valor númerico a un texto, dependiendo el sentimiento expresado por los usuarios en cada juego.

In [2]:
df_user_reviews["sentiment_analysis"] = df_user_reviews["reviews_review"].apply(tools.analisis_sentimiento)
df_user_reviews.head()

,user_id,reviews_item_id,reviews_helpful,reviews_recommend,reviews_review,year,sentiment_analysis
0,--000--,218230,No ratings yet,True,This game is just pure awesome. One of the be...,2014,2
1,--000--,233610,1 of 1 people (100%) found this review helpful,True,Distance is a wonderful racing game. The seco...,2015,1
2,--000--,210770,No ratings yet,True,Sanctum 2 is one really the only FPS/Tower Def...,2015,1
3,--000--,208650,3 of 5 people (60%) found this review helpful,False,I have played this game for an extensive amoun...,2014,1
4,--ace--,730,No ratings yet,True,One of the best FPS competetive games i hae pl...,2014,1

Cotejaremos algunos ejemplos para cada una de las clases de sentimiento

In [3]:

conteo_reviews = df_user_reviews["sentiment_analysis"].value_counts()

reviews_vacias = df_user_reviews["reviews_review"].isnull().sum()

total_reviews = len(df_user_reviews)

porcentaje_reviews = (conteo_reviews / total_reviews * 100).round(2)
porcentaje_reviews_vacias = (reviews_vacias / total_reviews * 100).round(2)



resumen_sentimientos = pd.DataFrame({
    "Conteo": conteo_reviews,
    "Porcentaje": porcentaje_reviews.round(2).astype(str) + '%'
})

# Ordenar el DataFrame por el conteo de mayor a menor
resumen_sentimientos = resumen_sentimientos.sort_values(by="Conteo", ascending=False)

# Imprimir los resultados
print("\nResumen de análisis de sentimientos:")
print(resumen_sentimientos)
print("\nConteo de reviews en blanco: ", reviews_vacias, " Porcentaje: ", porcentaje_reviews_vacias.round(2).astype(str) + '%')

Resumen de análisis de sentimientos:
                    Conteo Porcentaje
sentiment_analysis
1                    35241     61.43%
2                    17100     29.81%
0                     5026      8.76%

Conteo de reviews en blanco:  0  Porcentaje:  0.0%

In [4]:
tools.review_por_sentimiento(df_user_reviews["reviews_review"], df_user_reviews["sentiment_analysis"])

Para la categoría de análisis de sentimiento 0 se tienen estos ejemplos de reviews:
Review 1: This game is rubbish, a samurai sword takes just as long to kill them as punching them, I have been riped off by this stupid fn game and the creators should be lined up and shot
Review 2: fkn ♥♥♥♥ you garry ♥♥♥♥ ♥♥♥♥ing idiot ♥♥♥♥♥♥ ♥♥♥♥♥ ♥♥♥♥♥♥ ♥♥♥♥er
Review 3: The core concept is neat but it is so broken it took me over an hour to get a game with my friend and another 2 hours disconnecting and reconnecting... The game was just posted on steam and then never improved.


Para la categoría de análisis de sentimiento 1 se tienen estos ejemplos de reviews:
Review 1: Distance is a wonderful racing game.  The second game by the developers following Nitronic Rush.  This game is amazing in so many ways.  From the high speeds you can reach, to the tricks and stunts you can perform and the different game modes.  There is an incredibly detailed and awesome level editor, while the TrackMania series has the title for level editors, this game definetely is up there, with the ability to change light and colour of track pieces and the amount of scenery objects that can be placed.  When I play this game, I am constantly being remminded of Trackmania and how the cars felt when climbing up steep ramps and walls.  This game takes it further by adding in a jump feature allowing for some awesome manoeuvring over gaps and jumping from wall to wall like a car ninja.  For an early access, this is definetely something amazing.  We can all expect that this wil continue to get better with each update.  This is a game I would easily reccommend if they liked the TrackMania series cause they would almost feel right at home.  While anyone who has a fancy would enjoy it, TrackMania players would probably start off better.
Review 2: Sanctum 2 is one really the only FPS/Tower Defence Game.  No game has dones something like this before and had the risk of majorly failing.  Coffee Stains studios did extremely well in their game.  They've put so much detail into every map and enemy.  Coming from their first Sanctum, they really kept it up.  Even though there are big changes, it will still feel like the first one.  Both games rely heavily on your strategies.  There are multiple ways to beat the level but there are always those setups that beat every other.  I have to say, Co-op is where this really gets the fame and attention it has.  Playing a normal Tower Defence, you are by yourself, just watching things happen.  Sanctum solo makes you feel pretty awesome as you are taking down waves after waves.  But when the co-op starts, things get much better.  You and your friends will be jumping all over the map blasting enemies to pieces and having a great time.  I have played a lot more solo than I have co-op but I definetely like Co-op more.  You get more people to with resources to build your towers, two extra guns and 3 perks to switch with.  The choice of perks and weapons and towers are very important.  You don't want to take an Anti-Air tower into a map with no flying units (that's a wasted tower), and you don't want a perk that gives you speed increase if it's a map where you don't even need to run and you can stay still the whole time.  There are perks and weapons for almost every kind of play style, from cover sniper, to rocket launcher madman and your classic assault.  Downsides: Difficulty is random as the story continues.  And I don't mean if you do well on one level it suddenly gets hard.  I mean that you can be going through easy levels, then the next 2 are extremely hard and it gives no warning, suddenly gets hard then drops back down.  It will cause frustration but there is a restart button if you get stuck.  Lag:  I know this isn't the game's fault but if you are playing with someone and one of you has lag or gets a random lag spike, it really downs the game and makes it impossible to play properly.  If lag is an issue for you, stay away from Co-opTroll weapons:  I'm serious, there are some weapons in the game that look like they have been made for trolling other players.  They have serious knockback and will p*ss people off a lot.  It sends the person being shot flying and knocking them off the map in the middle of a big fight.  This is one of my favourite games because it's just works brilliantly in so many ways.  There are more things I should talk about such as how great the game looks and the little minigames featured, but I won't.  That's for you to experience.
Review 3: I have played this game for an extensive amount of hours. To make things clear now, just because I played it for a long time, doesn't mean I enjoyed the experience of it very much. First off as to why it's a poor quality game, is the obvious port problems. They have released many patches and updates trying to fix this but with each one they just bring in more problems that make the game even worse. I will say they have made the frame rate stable (for me at least) and they have fixed almost all the game crashing bugs (can't say the same about Arkham Origins). The story in this game, honestly wasn't very enjoyable. There were some plot twists that did throw the story around in a few directions but none of them ever lasted. The reveals and deaths weren't too effective, and many parts of the story that should have been important (including the Arkham Knight reveal) was basically shoved in your face the whole story leading up to it. Gameplay: Well it's terrible in most parts.Pros-The gliding and the overall look of the city is really nice and well done.          The graple controls are nice including the upgrade.          The upgrade system was clear and easy to understandCons-The feel of everything else was just awful. (This is going to be long)You could haer on the police radio that there is a riot taking place in an area nearby, so you can see with detecive vision that there is about 50 or so thugs just smashing stores and trashing the area, so you want to be a cool Batman and jump down and bash all those criminals up. BUT YOU CAN'T! They all run away except for about 5. It is so sad just watching as everyone runs away and you aggrivate them at all to get their attention so they can turn around and join the fight. Even Arkham Origins did this better with the Crime in Progress system where you can have everyone in the big fights try and kill which was about 20-30 or so thugs. So why not in this game? I want to test my skills against a big group of thugs. Another thing is the Batmobile, I was so excited to hear that you can drive the Batmobile, however when they first showed the design, it was extremely dissapointing, especially the look. The back of it is horrible, it looks like a bug from some angles which is awful. The feel of it is terrible too. Don't think I'm a bad driver because I am quite high in almost every single race event in this game, however it is just awful to drive. The race mechanics are just outright messed up. "Drifting slows down the timer to make one second in the timer last 3 in the real world". That is just awful because it means that people don't get rewarded for being really fast and driving at high speeds. You will get a better reward (and faster time) for driving really slowly and drifting than you would by doing tight turns and driving at high speeds (and the difference can be up to 1 minute depending on your style). Another thing about driving is the physics. There are many physics problems in this. You can touch a wall which you will normally smash right through any normal time, but far to often, you will be sent flying doing flips in the sky. Ridiculous. And I haven't even gotten to the part where they over use the Batmobile so much. *spoilers* they destroy the Batmobile at one stage against a stupid drill machine which is almost faster than the Batmobile itself, and then less than 5 minutes later they give you another one. They can't keep it away from you. *end spoilers* They use it for everything. And every puzzle and trap possible just so happens to be only activated by the Batmobile! I will say that the combat challenges in the Batmobile are alright. Not good but alright. They are mostly easy and get very simple very quick. I don't put much more than 3 minutes of effort into it because that's as much variety as there is and it's not worth getting high on the leaderboard. Now moving onto combat. Oh boy, oh boy. This is the biggest problem in this game by a long shot. I can spend hours and hours talking about everything wrong with it, but I wont because I've been making youtube videos to do that for me. The combat is awful and broken and just down right disapointing. I will start with the normal problems that need to be modified (this is excluding glitches). 1. Charging thugs: This was a stupid idea. A thug that runs at incredibly slow speed can only be stopped by a batarang to the face. (Or evade which doesn't stop them but avoids them). For some reason a flying kick from Batman to the face is beaten by a man doing a bit more than a jog. It's incredibly odd and stupid, and their hit box is far to big. They have a hit box of about 2 thugs wide.2. Camera in combat: It is the worst of the series. It will pan around for stupid reasons even when you don't want it to, and the problem with that is that the combat priotisation is based on your camera direction. Also a move you can unlock and perform is the Special Batclaw slam which grapples the target and you fly at him and flip over you and slam him into the ground. (A bit different when doing this to a Brute but the same problem is there) The camera does this stupid movie action look where it zooms in on their torso's and you can't see a damn thing. Sometimes there is a glitch where that camera shot doesn't work and it stays at the distant 3rd person look (and you know you messed up when a glitch makes what you have look sh*t). They need to get rid of the zoom on that move. It cause everyone to step back but it spins the camera as well messing things up for about .75 of a second (and that's important). Also the camera doesn't do well when near a wall (it might be a glitch so I'll explain it in that part). 3. Target Priorisation: This is one of the worst. They have many challenge maps in this game such as the combo master which means you need to keep one combo for as long as possible. I am not bad at Arkham Combat, I've gotten hundreds of thousands of points (millions for some) in challenge maps and I've gotten a nice score in combo master of over 250. Which was good for the first 3 days when it came out and the frame rates absolutely murdered itself when the timer starts on the screen and the frames drop to 1 per second. But now it's terrible. Keeping combos for more than 200 is almost impossible. Special moves such as disarm and destroy don't know what they are doing. They need a proper order of importance beacuse for some reason, the game seems to think that poles and baseball bats are more of a threat than stun sticks or shields. (Even though baseball bats and poles are weapons Batman can use) Basic Free flow combat has got it wrong also. I can look straight at a thug without anything in his hand, I aim at him, I go for him, but the game decides that the man 3 thugs behind him with a stun stick is the right target to pick which kills the combo and fails the challenge. It's just terrible. In one of the videos I'm making, I will be including a full length statement including how priotisation and the combat should be working to make things good again. There is more but I will move onto the glitches.Camera against walls: Combo challenge is a perfect example. There isn't a proper boundary in that challenge, it just some purple walls that fizzle which used to murder frame rates right? Well for some reason the camera glitches like crazy when you try and look behind you when punching someone against those walls. Those walls need to let the camera go through them at least cause it messes so much up. Counters: They are broken as hell. I get so many instances where a thug wants to attack so me so I counter, but they just freeze and don't attack and Batman doesn't move so it drops the combo. You can't do anything but watch for one second as nothing happens and watch your chance of getting a high score vanish. These need to fixed because they cause extreme game impacting problems. I have run out of room for this review. Don't buy.


Para la categoría de análisis de sentimiento 2 se tienen estos ejemplos de reviews:
Review 1: This game is just pure awesome.  One of the best MMOFPS games you will found out there.  The moment you land on the battlefield you already get excited and are eager to get into the action.  The wide variety of weapons is great with Heavy class carrying SAWS and Battle Rilfes to the Medic carrying around a deadly SMG.  Not only is it just a land game but you can fly in different ships and carry team mates from one place to another.  Land vechiles are extreme and the team with good aim and good weapons is sure to come out on top.  the battles can get very hectic.  Even small battles like 5 v 5 in a small area can get hard and challenging.  Defence and offence.  this game has it.  I hope this was good and I look forward to seeing you on the Planetside.  get shooting everyone!
Review 2: awesome ♥♥♥♥♥ awesome
Review 3: Quite a dissapointment to what was shown on the trailers.A huge "Pay to win" fest, You will be surprised on what you can do for free... not very muchOverall the gameplay is nice, Playing against other players either as Police or the Criminals brings fun and competitive gameplay.The customisation is lacking unless you pay real money...Unless you play with friends this game becomes a huge dissapointment to quickly.

Habiendo confirmado los porcentajes y ejemplos, eliminaremos la columna "reviews_review".

In [5]:
df_user_reviews = df_user_reviews.drop(columns=["reviews_review"])
df_user_reviews.columns

Index(['user_id', 'reviews_item_id', 'reviews_helpful', 'reviews_recommend',
       'year', 'sentiment_analysis'],
      dtype='object')

In [6]:
tools.ver_tipo_datos(df_user_reviews)

         nombre_campo        tipo_datos  no_nulos_%  nulos_%  nulos
0             user_id   [<class 'str'>]       100.0      0.0      0
1     reviews_item_id   [<class 'int'>]       100.0      0.0      0
2     reviews_helpful   [<class 'str'>]       100.0      0.0      0
3   reviews_recommend  [<class 'bool'>]       100.0      0.0      0
4                year   [<class 'int'>]       100.0      0.0      0
5  sentiment_analysis   [<class 'int'>]       100.0      0.0      0

### userData 

Ahora nos enfocaremos, en encontrar la forma de usar los datos a partir de los dataframes que abrimos en la parte inicial de este archivo, para así calcular la cantidad que cada usuario invirtió en videojuegos y los productos que compró, esto último a partir de su item.

In [7]:
df_dinero_gastado = df_users_items[["items_count","user_id", "item_id"]]
df_dinero_gastado

         items_count            user_id  item_id
0                277  76561197970982479       10
1                277  76561197970982479       30
2                277  76561197970982479      300
3                277  76561197970982479      240
4                277  76561197970982479     3830
...              ...                ...      ...
3246370            7  76561198329548331   304930
3246371            7  76561198329548331   227940
3246372            7  76561198329548331   388490
3246373            7  76561198329548331   521570
3246374            7  76561198329548331   519140

[3246375 rows x 3 columns]

Ahora realizaremos dataFrame auxiliar con el precio de cada juego para luego fucionarlo con el dataFrame anterior.

In [8]:
df_precio_juegos = df_steam_games[["price", "item_id"]]
df_precio_juegos

       price  item_id
0       4.99   761140
1       4.99   761140
2       4.99   761140
3       4.99   761140
4       4.99   761140
...      ...      ...
71546   1.99   610660
71547   1.99   610660
71548   1.99   610660
71549   4.99   658870
71550   4.99   658870

[71551 rows x 2 columns]

In [9]:
# Eliminaremos los duplicados
df_precio_juegos = df_precio_juegos.drop_duplicates(subset = "item_id", keep="first")
df_precio_juegos

       price  item_id
0       4.99   761140
5       0.00   643980
9       0.00   670290
14      0.99   767400
17      3.99   772540
...      ...      ...
71535   1.99   745400
71539   1.99   773640
71543   4.99   733530
71546   1.99   610660
71549   4.99   658870

[28850 rows x 2 columns]

Ahora si fusionaremos los dos dataframes anteriores para crear un solo dataframe.

In [10]:
df_dinero_gastado = df_dinero_gastado.merge(df_precio_juegos, on="item_id", how="left")
df_dinero_gastado

         items_count            user_id  item_id  price
0                277  76561197970982479       10   9.99
1                277  76561197970982479       30   4.99
2                277  76561197970982479      300   9.99
3                277  76561197970982479      240  19.99
4                277  76561197970982479     3830   9.99
...              ...                ...      ...    ...
3246370            7  76561198329548331   304930   0.00
3246371            7  76561198329548331   227940   0.00
3246372            7  76561198329548331   388490   0.00
3246373            7  76561198329548331   521570   0.00
3246374            7  76561198329548331   519140    NaN

[3246375 rows x 4 columns]

In [11]:
tools.ver_tipo_datos(df_dinero_gastado)

  nombre_campo         tipo_datos  no_nulos_%  nulos_%   nulos
0  items_count    [<class 'int'>]      100.00     0.00       0
1      user_id    [<class 'str'>]      100.00     0.00       0
2      item_id    [<class 'int'>]      100.00     0.00       0
3        price  [<class 'float'>]       85.31    14.69  476857

Observamos que la columna "price" contiene nulos. Por lo tanto, vamos a explorarla.

In [12]:
df_dinero_gastado[df_dinero_gastado["price"].isnull()]

         items_count            user_id  item_id  price
16               277  76561197970982479     9340    NaN
31               277  76561197970982479    23120    NaN
34               277  76561197970982479    35010    NaN
40               277  76561197970982479    24860    NaN
41               277  76561197970982479    39530    NaN
...              ...                ...      ...    ...
3246337           36  76561198312638244   202990    NaN
3246338           36  76561198312638244   212910    NaN
3246360            5  76561198320038728    39000    NaN
3246365          321  76561198320136420   496920    NaN
3246374            7  76561198329548331   519140    NaN

[476857 rows x 4 columns]

Hasta ahora, tenemos un 14% de productos que no tienen precio. Asumiremos que no contienen un precio porque son gratuitos. Entonces, los vamos a rellenar con 0.0

In [13]:
df_gratuito = df_dinero_gastado["price"].fillna(0.0)
# Borramos la columna original y concatenamos la columna rellena con todo el dataframe
df_gasto_items = pd.concat([df_dinero_gastado.drop("price", axis=1), df_gratuito], axis=1)
df_gasto_items

         items_count            user_id  item_id  price
0                277  76561197970982479       10   9.99
1                277  76561197970982479       30   4.99
2                277  76561197970982479      300   9.99
3                277  76561197970982479      240  19.99
4                277  76561197970982479     3830   9.99
...              ...                ...      ...    ...
3246370            7  76561198329548331   304930   0.00
3246371            7  76561198329548331   227940   0.00
3246372            7  76561198329548331   388490   0.00
3246373            7  76561198329548331   521570   0.00
3246374            7  76561198329548331   519140   0.00

[3246375 rows x 4 columns]

Una vez unido el Dataframe, podemos eliminar la columna "item_id"

In [14]:
df_gasto_items = df_gasto_items.drop("item_id", axis = 1)
df_gasto_items

         items_count            user_id  price
0                277  76561197970982479   9.99
1                277  76561197970982479   4.99
2                277  76561197970982479   9.99
3                277  76561197970982479  19.99
4                277  76561197970982479   9.99
...              ...                ...    ...
3246370            7  76561198329548331   0.00
3246371            7  76561198329548331   0.00
3246372            7  76561198329548331   0.00
3246373            7  76561198329548331   0.00
3246374            7  76561198329548331   0.00

[3246375 rows x 3 columns]

Sumaremos lo consumido en la plataforma, teniendo en cuenta el nombre de usuario.

In [15]:
df_gasto_items_total = df_gasto_items.groupby("user_id")["price"].sum().reset_index()
df_gasto_items_total

                 user_id    price
0                --000--   182.84
1                --ace--   122.89
2              --ionex--    99.93
3           -2SV-vuLB-Kg   234.69
4      -404PageNotFound-  1154.47
...                  ...      ...
68398             zzonci     0.00
68399        zzoptimuszz     4.99
68400            zzydrax    99.94
68401              zzyfo   484.73
68402         zzzmidmiss   328.75

[68403 rows x 2 columns]

Ahora crearemos un dataFrame para saber la cantidad de items consumidos por los usuarios y eliminaremos los nombres de usuarios repetidos

In [16]:
df_cantidad_items = df_gasto_items[["items_count", "user_id"]]
df_cantidad_items = df_cantidad_items.drop_duplicates(subset="user_id", keep="first")
df_cantidad_items

         items_count            user_id
0                277  76561197970982479
198              888            js41637
717              137          evcentric
821              328         Riot-Punch
951              541              doctr
...              ...                ...
3246360            5  76561198320038728
3246365          321  76561198320136420
3246367            4          ArkPlays7
3246369           22  76561198323066619
3246370            7  76561198329548331

[68403 rows x 2 columns]

Ahora uniremos los dos últimos dataFrames creados para tenerlo lista para nuestro segundo Endpoint 2

In [17]:
df_user_data = df_cantidad_items.merge(df_gasto_items_total, on="user_id", how="right")
df_user_data

       items_count            user_id    price
0               58            --000--   182.84
1               44            --ace--   122.89
2               23          --ionex--    99.93
3               68       -2SV-vuLB-Kg   234.69
4              149  -404PageNotFound-  1154.47
...            ...                ...      ...
68398            5             zzonci     0.00
68399           61        zzoptimuszz     4.99
68400           13            zzydrax    99.94
68401           84              zzyfo   484.73
68402           69         zzzmidmiss   328.75

[68403 rows x 3 columns]

## UserForGenre

Queremos saber que cantidad de tiempo jugó cada usuario un género en particular. Para ello, crearemos dataFrames auxiliares para luego fusionarlos.

In [18]:
df_playtime_usuario_item = df_users_items[["played_hours", "user_id", "item_id"]]
df_playtime_usuario_item

         played_hours            user_id  item_id
0                0.10  76561197970982479       10
1                0.12  76561197970982479       30
2               78.88  76561197970982479      300
3               30.88  76561197970982479      240
4                5.55  76561197970982479     3830
...               ...                ...      ...
3246370         11.28  76561198329548331   304930
3246371          0.72  76561198329548331   227940
3246372          0.05  76561198329548331   388490
3246373          0.07  76561198329548331   521570
3246374          0.05  76561198329548331   519140

[3246375 rows x 3 columns]

Ahora, extraeremos información del dataframe "df_steam_games"

In [19]:
df_genero = df_steam_games[["genres", "item_id", "release_year"]]

df_genero

           genres  item_id release_year
0          Action   761140         2018
1          Casual   761140         2018
2           Indie   761140         2018
3      Simulation   761140         2018
4        Strategy   761140         2018
...           ...      ...          ...
71546       Indie   610660         2018
71547      Racing   610660         2018
71548  Simulation   610660         2018
71549      Casual   658870         2017
71550       Indie   658870         2017

[71551 rows x 3 columns]

Ahora, uniremos los dos dataFrames

In [20]:
df_tiempo_genero = df_playtime_usuario_item.merge(df_genero, on="item_id")
df_tiempo_genero

         played_hours            user_id  item_id     genres release_year
0                0.10  76561197970982479       10     Action         2000
1                1.55              doctr       10     Action         2000
2                1.80     corrupted_soul       10     Action         2000
3                5.47         WeiEDKrSat       10     Action         2000
4              104.58       death-hunter       10     Action         2000
...               ...                ...      ...        ...          ...
6845688          0.02  76561198146468235   367090     Action         2015
6845689          0.02  76561198146468235   367090      Indie         2015
6845690          0.02  76561198146468235   367090     Sports         2015
6845691          0.02          massimo23   448540  Adventure         2016
6845692          0.02          massimo23   448540      Indie         2016

[6845693 rows x 5 columns]

Agruparemos el dataFrame por género y usuario y sumaremos el tiempo de juego para cada caso. De aquí, obtendremos la información para nuestro Endpoint 3.

In [21]:
# Se agrupa por usuario y se suma el tiempo de juego
df_userforgenre = df_tiempo_genero.groupby(["genres", "release_year","user_id"])["played_hours"].sum().reset_index()

df_userforgenre

                 genres release_year            user_id  played_hours
0                Action         1983               2Ta4          0.30
1                Action         1983  76561197966936422          5.52
2                Action         1983  76561197968887720          0.02
3                Action         1983  76561197969020980          1.63
4                Action         1983  76561197971401137          0.55
...                 ...          ...                ...           ...
2893382  Web Publishing         2017         Eosoforcus          0.97
2893383  Web Publishing         2017          N47H4NI3L         27.25
2893384  Web Publishing         2017            dirklah         13.27
2893385  Web Publishing         2017         kushziller          4.18
2893386  Web Publishing         2017             wiinga          7.85

[2893387 rows x 4 columns]

### Developer

Aquí buscaremos un dataFrame que contenga los items que cada desarrollador haya creado el año de lanzamiento y el precio de cada uno. De aquí obtendremos la información para nuestro Endpoint 1.

In [22]:
df_steam_games.columns

Index(['genres', 'price', 'early_access', 'item_id', 'release_year',
       'publisher', 'name', 'title', 'developer'],
      dtype='object')

In [32]:
df_item_developer_year = df_steam_games[["price", "release_year", "developer", "item_id"]]
# se eliminan los duplicados
df_item_developer_year = df_item_developer_year.drop_duplicates()
df_item_developer_year

       price release_year                 developer  item_id
0       4.99         2018                 Kotoshiro   761140
5       0.00         2018          Secret Level SRL   643980
9       0.00         2017              Poolians.com   670290
14      0.99         2017                      彼岸领域   767400
17      3.99         2018       Trickjump Games Ltd   772540
...      ...          ...                       ...      ...
71535   1.99         2018           Bidoniera Games   745400
71539   1.99         2018        Nikita "Ghost_RUS"   773640
71543   4.99         2018                    Sacada   733530
71546   1.99         2018  Laush Dmitriy Sergeevich   610660
71549   4.99         2017             xropi,stev3ns   658870

[28850 rows x 4 columns]

Agregaremos el año de lanzamiento de un juego al dataFrame "df_user_reviews". Extraeremos las columnas de id del juego y su año de lanzamiento, borraremos los duplicados y luego lo fusionaremos con el dataframe de user_reviews.

In [24]:
df_item_release_year = df_steam_games[['item_id', 'release_year']]

df_item_release_year = df_item_release_year.rename(columns={'item_id':'reviews_item_id'})

df_item_release_year = df_item_release_year.drop_duplicates()
df_item_release_year

       reviews_item_id release_year
0               761140         2018
5               643980         2018
9               670290         2017
14              767400         2017
17              772540         2018
...                ...          ...
71535           745400         2018
71539           773640         2018
71543           733530         2018
71546           610660         2018
71549           658870         2017

[28850 rows x 2 columns]

In [25]:
df_user_reviews = df_user_reviews.merge(df_item_release_year, on='reviews_item_id')
df_user_reviews

,user_id,reviews_item_id,reviews_helpful,reviews_recommend,year,sentiment_analysis,release_year
0,--000--,218230,No ratings yet,True,2014,2,2012
1,112asdasfasdasd,218230,No ratings yet,True,2013,1,2012
2,1234567890192837465,218230,No ratings yet,True,2014,1,2012
3,2828838282,218230,No ratings yet,True,2012,1,2012
4,2sd31,218230,No ratings yet,True,2013,1,2012
...,...,...,...,...,...,...,...
48797,yougotblehed,315340,15 of 32 people (47%) found this review helpful,False,2014,1,2014
48798,yougoyu,424370,5 of 11 people (45%) found this review helpful,True,2014,1,2016
48799,zayyntt,479260,12 of 14 people (86%) found this review helpful,True,2014,1,2016
48800,zayyntt,463550,2 of 3 people (67%) found this review helpful,True,2014,1,2016
48801,zevlupine,383270,5 of 6 people (83%) found this review helpful,True,2014,1,2016

### best_developer_year  / developer_reviews_analysis

Queremos buscar los mejores desarrolladores con más juegos recomendados por año. Por otro lado, queremos buscar al desarrollador y la cantidad de comentarios positivos y negativos que este tenga. 
Consideramos que la información que buscan se asemeja, por eso, tomamos la decisión de crear un solo dataframe para obtener la información de ambos.

In [26]:
#Cambiamos el nombre de la columna para que sea igual a la columna del otro dataFrame
df_user_reviews.rename(columns={'reviews_item_id': 'item_id'}, inplace=True)
df_user_reviews

,user_id,item_id,reviews_helpful,reviews_recommend,year,sentiment_analysis,release_year
0,--000--,218230,No ratings yet,True,2014,2,2012
1,112asdasfasdasd,218230,No ratings yet,True,2013,1,2012
2,1234567890192837465,218230,No ratings yet,True,2014,1,2012
3,2828838282,218230,No ratings yet,True,2012,1,2012
4,2sd31,218230,No ratings yet,True,2013,1,2012
...,...,...,...,...,...,...,...
48797,yougotblehed,315340,15 of 32 people (47%) found this review helpful,False,2014,1,2014
48798,yougoyu,424370,5 of 11 people (45%) found this review helpful,True,2014,1,2016
48799,zayyntt,479260,12 of 14 people (86%) found this review helpful,True,2014,1,2016
48800,zayyntt,463550,2 of 3 people (67%) found this review helpful,True,2014,1,2016
48801,zevlupine,383270,5 of 6 people (83%) found this review helpful,True,2014,1,2016

Extraemos las columnas necesarias en dataFrames y analizamos los datos

In [27]:
df_1 = df_user_reviews[["item_id", "reviews_recommend", "sentiment_analysis", "year" ]]
tools.ver_tipo_datos(df_1)

         nombre_campo        tipo_datos  no_nulos_%  nulos_%  nulos
0             item_id   [<class 'int'>]       100.0      0.0      0
1   reviews_recommend  [<class 'bool'>]       100.0      0.0      0
2  sentiment_analysis   [<class 'int'>]       100.0      0.0      0
3                year   [<class 'int'>]       100.0      0.0      0

In [28]:
df_2 = df_steam_games[["item_id","developer"]]
tools.ver_tipo_datos(df_1)

         nombre_campo        tipo_datos  no_nulos_%  nulos_%  nulos
0             item_id   [<class 'int'>]       100.0      0.0      0
1   reviews_recommend  [<class 'bool'>]       100.0      0.0      0
2  sentiment_analysis   [<class 'int'>]       100.0      0.0      0
3                year   [<class 'int'>]       100.0      0.0      0

Ahora, fusionaremos el df_1 y el df_2 en un solo dataFrame

In [29]:
df_best_developer = df_1.merge(df_2, on='item_id')
df_best_developer

,item_id,reviews_recommend,sentiment_analysis,year,developer
0,218230,True,2,2014,Daybreak Game Company
1,218230,True,2,2014,Daybreak Game Company
2,218230,True,2,2014,Daybreak Game Company
3,218230,True,1,2013,Daybreak Game Company
4,218230,True,1,2013,Daybreak Game Company
...,...,...,...,...,...
122014,479260,True,1,2014,"Roman Anatolevich,Denis Ovsyannikov"
122015,463550,True,1,2014,dobro_slon
122016,463550,True,1,2014,dobro_slon
122017,383270,True,1,2014,Fiddlesticks Games
122018,383270,True,1,2014,Fiddlesticks Games

## Carga de los dataframes

In [30]:
dfs = [df_user_reviews, df_user_data, df_userforgenre, 
       df_item_developer_year, df_best_developer]
# Nombres correspondientes a cada DataFrame
names = ["df_user_reviews", "df_user_data","df_userforgenre", 
         "df_item_developer_year", "df_best_developer"]

for df, name in zip(dfs, names):
    archivo = f"{name}_FE.csv"
    df.to_csv(archivo, index=False, encoding="utf-8")
    print(f"DataFrame '{name}' guardado como '{archivo}'")

DataFrame 'df_user_reviews' guardado como 'df_user_reviews_FE.csv'
DataFrame 'df_user_data' guardado como 'df_user_data_FE.csv'
DataFrame 'df_userforgenre' guardado como 'df_userforgenre_FE.csv'
DataFrame 'df_item_developer_year' guardado como 'df_item_developer_year_FE.csv'
DataFrame 'df_best_developer' guardado como 'df_best_developer_FE.csv'

Aprovecharemos para guardar los dataFrame en formato parquet y así optimizar la estructura de los datos en el deploy.

In [31]:
for df, name in zip(dfs, names):
    archivo = f"{name}.parquet"
    pq.write_table(pa.Table.from_pandas(df), archivo)
    print(f"DataFrame '{name}' guardado como '{archivo}'")

DataFrame 'df_user_reviews' guardado como 'df_user_reviews.parquet'
DataFrame 'df_user_data' guardado como 'df_user_data.parquet'
DataFrame 'df_userforgenre' guardado como 'df_userforgenre.parquet'
DataFrame 'df_item_developer_year' guardado como 'df_item_developer_year.parquet'
DataFrame 'df_best_developer' guardado como 'df_best_developer.parquet'